/**********************************************************
Name:KUAS-Hw/Hw15
Date:2016/05/10
Final:2016/05/11
By CharlotteHong
**********************************************************/
using namespace std;
char choose;
string str_in;
string MainMenu = "\n \
==================================================\n \
        MainMenu\n \
==================================================\n \
    1. 輸入數字字串 (1) => 英文字串(One)\n \
    2. 輸入文字字串 依每字串依每2位分開\n \
    3. 輸入文字字串 以空白隔開 => 回傳子字串的長度\n \
    Q. Exit\n \
==================================================\n";
/* ===================================================== */
string one(string str);
string two(string str, int n);
string three(string str);
/* ===================================================== */
